import pandas as pd
df = pd.read_csv('GoogleApps.csv')
#DataFrame


# Как называется приложение, расположенное первым в наборе данных?
print(df.head(1))


# К какой категории (Category) относится приложение, расположенное последним в наборе данных?
print(df.tail())


# Сколько столбцов содержится в наборе данных?
# Данные какого типа хранятся в каждом из столбцов?
print(df.info())

# Укажи среднее арифметическое и медиану размера приложений (Size)
# Сколько стоит самое дорогое приложение?
# Укажи среднее арифметическое и медиану количества установок приложений (Installs)
print(df.describe())

print(type(df))

